# -*- coding: utf-8 -*-
# author:shihua
# coder:shihua
# 这是一个fiche常用命令行接口类
"""
模块介绍
-------

这是一个fiche常用命令行接口类

设计模式：

    无

关键点：    

    （1）click 

主要功能：            

    （1）fiche程序管理
                                                     
使用示例
-------


类说明
------

"""



####### 载入程序包 ##########################################################
############################################################################



import click
import os
import sys
from rich.console import Console
import fiche as fc



####### CLI命令行接口 #######################################################
### 设计模式：                                                            ###
###     无                                                               ###
### 关键点：                                                              ###
### （1）click                                                           ###
### 主要功能：                                                            ###
### （1）fiche程序管理                                                    ###
############################################################################



###### CLI命令行接口 #####################################################################
#########################################################################################



### fiche命令组
@click.group()
@click.help_option('-H','--help')
@click.version_option('-V','--version')
def fiche():
    console = Console()
    console.print("\n\
                   =========================================================================== \n\
                   =======                                                             ======= \n\
                   =======                    Hello! Welcome to Fiche                  ======= \n\
                   =======                                                             ======= \n\
                   ===========================================================================",style="red")


### fiche启动后台服务
@click.command(help="start fiche service")
def start_service():
    console = Console()
    api_path = fc.__file__.replace('__init__.py','')### __init__.py前的atom\需要去掉，打包后
    console.print('=================================================================>>>>>> fiche servive start',style="red")
    system_platform = sys.platform
    if system_platform == 'win32':
        os.system("{} & cd {} & python .\service.py".format(api_path[:2],api_path))
    elif system_platform == 'linux':
        os.system("cd {} & python ./service.py".format(api_path))
    # uvicorn api:app --reload --host '0.0.0.0' --port 11811


### 向fiche命令组添加命令
fiche.add_command(start_service) 


### python脚本主程化
if __name__ == '__main__':
    console = Console()
    console.print("\n\
                   =========================================================================== \n\
                   =======                                                             ======= \n\
                   =======                    Hello! Welcome to Fiche                  ======= \n\
                   =======                                                             ======= \n\
                   ===========================================================================",style="red")
    fiche()



#################################################################################################################################################
#################################################################################################################################################


